<?php

	/*
	*Объединить две ранее написанные функции в одну, которая получает строку на русском
	языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача
	решается при конструировании url-адресов на основе названия статьи в блогах).
	*/

	$alphabet = ['а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'j', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'c', 'ч' => 'ch', 'ш' => 'sh', 'щ' => 'ch', 'ъ' => '\'', 'ы' => 'y', 'ь' => '\'', 'э' => 'eh', 'ю' => 'yu', 'я' => 'ya', 'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'YO', 'Ж' => 'ZH', 'З' => 'Z', 'И' => 'I', 'Й' => 'J', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O', 'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T', 'У' => 'U', 'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C', 'Ч' => 'CH', 'Ш' => 'SH', 'Щ' => 'CH', 'Ъ' => '\'', 'Ы' => 'Y', 'Ь' => '\'', 'Э' => 'EH', 'Ю' => 'YU', 'Я' => 'YA'
	];

	$phrase = "Я лЮбЛю ПрОгРаМмИрОвАтЬ!!!!!111111";

	function translate($phrase, $alphabet) {
		$translatePhrase = strtr($phrase, $alphabet);

		$substring = [" "];
		$symbols = ["_"];
		$replaceSpaceWithUnderscore = str_replace($substring, $symbols, $translatePhrase);

		return$replaceSpaceWithUnderscore;
	}

	echo "<h1>".translate($phrase, $alphabet)."</h1>";